app/controllers/api/v1/companies_controller.rb

INSERT INTO "companies" ("name", "rfc", "email", "phone", "city", "number_ext", "number_int", "postal_code", "state", "suburb", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
---
  def create
    company = Company.new(company_params)
    return render json: { errors: company.errors, message: "company couldn't be created.", success: false }, status: :unprocessable_entity if !company.save

UPDATE "companies" SET "phone" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["phone", "5520202020"], ["updated_at", "2018-10-09 00:26:08.446381"], ["id", 2]]
---
  def update
    return render json: { errors: @company.errors, message: "company couldn't be updated successfully.", success: false }, status: :unprocessable_entity if !@company.update(company_params)

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_company
    @company = Company.find(params[:id])