app/controllers/api/v1/registrations_controller.rb

  def index
    authorize Registration
    @registrations = Registration.all.select(columns) if current_resource_owner.admin?
    @registrations = Registration.where(user_id: current_resource_owner.id) if current_resource_owner.employee?
---
SELECT "registrations".* FROM "registrations" WHERE "registrations"."user_id" = $1  [["user_id", 3]]

  def create
    authorize Registration
    registration = Registration.new(registration_params)
    return render json: { errors: registration.errors, message: "registration couldn't be created.", success: false }, status: :unprocessable_entity if !registration.save
---
INSERT INTO "registrations" ("check_in", "check_out", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["check_in", "2018-10-08 00:00:00"], ["check_out", "2018-10-08 00:00:00"], ["user_id", 2], ["created_at", "2018-10-09 00:29:36.819996"], ["updated_at", "2018-10-09 00:29:36.819996"]]

  def update
    authorize Registration
    return render json: { errors: @registration.errors, message: "registration couldn't be updated successfully.", success: false }, status: :unprocessable_entity if !@registration.update(registration_params)
---
UPDATE "registrations" SET "check_out" = $1, "updated_at" = $2 WHERE "registrations"."id" = $3  [["check_out", "2018-10-08 17:10:01"], ["updated_at", "2018-10-09 00:36:17.350254"], ["id", 2]]

  def find_registration
    @registration = Registration.find(params[:id])
---
SELECT  "registrations".* FROM "registrations" WHERE "registrations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]