app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def index
    authorize User
    @users = User.all.select(columns) if current_resource_owner.admin?
    @users = User.where(companies_id: params[:companie_id] ).select(columns) if current_resource_owner.admin? and !params[:companie_id].nil?

INSERT INTO "users" ("name", "paternal", "maternal", "phone", "email", "encrypted_password", "city", "number_ext", "number_int", "postal_code", "state", "suburb", "address", "role", "created_at", "updated_at", "companies_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17) RETURNING "id"
---
  def create
    authorize User
    user = User.new(user_params)
    user.password = params[:password]
    user.password_confirmation = params[:password_confirmation]
    return render json: { errors: user.errors, message: "User couldn't be created.", success: false }, status: :unprocessable_entity if !user.save

UPDATE "users" SET "paternal" = $1, "name" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["paternal", "Test6"], ["name", "Test6"], ["updated_at", "2018-10-09 00:18:02.510905"], ["id", 6]]
---
  def update
    authorize User
    return render json: { errors: @user.errors, message: "User couldn't be updated successfully.", success: false }, status: :unprocessable_entity if !@user.update(user_params)